import React from "react";

function page() {
  return (
    <section className="text-right flex justify-center items-center py-12">
      <div className="bg-white shadow-lg rounded-lg p-6 mb-6 w-3/4">
        <h1 className="text-2xl font-bold mb-4">من نحن ؟</h1>
        <p className="mb-4 text-balance">
          نحن في HerStyle نسعى جاهدين لتقديم أفضل مستحضرات التجميل والعناية
          بالبشرة والشعر بأعلى جودة وأسعار تنافسية. يتم اختيار منتجاتنا بعناية
          لتلبية احتياجات عملائنا وتوفير تجربة تسوق فريدة تلبي توقعاتهم.
        </p>
        <p className="mb-4">
          منذ تأسيسنا، كنا ملتزمين بأن نكون جزءًا من رحلة الجمال الخاصة بكم،
          ونضمن أن تكون منتجاتنا آمنة وفعّالة، ونحرص على تقديم خدمة عملاء مميزة
          تلبي جميع استفساراتكم واحتياجاتكم.
        </p>
        <p>
          نسعى دائمًا إلى الابتكار وتقديم كل ما هو جديد في عالم مستحضرات التجميل
          من خلال التزامنا بمعايير الجودة والموثوقية. شكراً لثقتكم بنا ونعدكم
          بالاستمرار في تقديم كل ما يعزز جمالكم الطبيعي.{" "}
        </p>
      </div>
    </section>
  );
}

export default page;
